Revit 2025 API
Rebar.SetBarIncluded Method
 Sets if the bar at the desired index is included or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetBarIncluded(
	bool include,
	int barPositionIndex
)
Public Sub SetBarIncluded (
	include As Boolean,
	barPositionIndex As Integer
)
public:
void SetBarIncluded(
	bool include,
	int barPositionIndex
)
member SetBarIncluded :
        include : bool *
        barPositionIndex : int -> unit
Parameters
include Boolean
 True to include the bar, false to exclude the bar.
barPositionIndex Int32
 The bar index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace